Tekla.Structures.Catalogs.RebarItemEnumerator
The RebarItemEnumerator class allows to loop through the catalog rebar items.

Tekla.Structures.Catalogs.RebarItemEnumerator.#ctor
Creates a new instance of the RebarItemEnumerator.

Tekla.Structures.Catalogs.RebarItemEnumerator.System#Collections#IEnumerator#Current
Implementation for the Current property required by IEnumerator. The returned object
is always of type RebarItem.

Tekla.Structures.Catalogs.RebarItemEnumerator.Current
Returns a rebar item instance of the current element.

Tekla.Structures.Catalogs.RebarItemEnumerator.HeaderItems
Gets the header items.

Tekla.Structures.Catalogs.RebarItemEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Catalogs.RebarItemEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Catalogs.RebarItemEnumerator.GetSize
Returns the total amout of items.
Returns: The total amount of items.

Tekla.Structures.Catalogs.RebarItemEnumerator.SelectRebarItem(System.String,System.String,System.Double)
Selects a rebar item in the rebar database with the given grade, size and bending radius.
Grade: The grade of the rebar item to select.
Size: The size of the rebar item to select.
BendRadius: The bending radius of the rebar item to select.
Returns: The first RebarItem that matches the conditions.

Tekla.Structures.Catalogs.RebarItemEnumerator.SelectRebarItem(System.String,System.String,System.String,System.String)
Selects a rebar item in the rebar database with the given grade, size, usage and code.
Grade: The grade of the rebar item to select.
Size: The size of the rebar item to select.
Usage: The usage of the rebar item to select.
Code: The code of the rebar item to select.
Returns: The first RebarItem that matches the conditions.

Tekla.Structures.Catalogs.RebarItemEnumerator.SelectRebarItem(System.String,System.String,System.String)
Selects a rebar item in the rebar database with the given grade, size and usage.
Grade: The grade of the rebar item to select.
Size: The size of the rebar item to select.
Usage: The usage of the rebar item to select.
Returns: The first RebarItem that matches the conditions.

Tekla.Structures.Catalogs.RebarItemEnumerator.SelectRebarItem(System.String,System.String)
Selects a rebar item in the rebar database with the given grade and size.
Grade: The grade of the rebar item to select.
Size: The size of the rebar item to select.
Returns: The first RebarItem that matches the conditions.

Tekla.Structures.Catalogs.RebarItemEnumerator.SelectRebarItem(System.String,System.Double,System.Double,System.Boolean)
Selects a rebar item in the rebar database with the given grade, nominal diameter and bending radius.
Grade: The grade of the rebar item to select.
Diameter: The diameter of the rebar item to select.
BendRadius: The bending radius of the rebar item to select.
UseNominalDiameter:
If set to false, the item is selected based on the actual diameter.
If true, the item is selected based on the nominal diameter.
Returns: The first RebarItem that matches the conditions.

Tekla.Structures.Catalogs.RebarItemEnumerator.SelectRebarItem(System.String,System.Double,System.String,System.Boolean)
Selects a rebar item in the rebar database with the given grade, nominal diameter and bending radius.
Grade: The grade of the rebar item to select.
Diameter: The diameter of the rebar item to select.
Usage: The usage of the rebar item to select.
UseNominalDiameter:
If set to false, the item is selected based on the actual diameter.
If true, the item is selected based on the nominal diameter.
Returns: The first RebarItem that matches the conditions.

Tekla.Structures.Catalogs.RebarItemEnumerator.SelectRebarItem(System.String,System.Double,System.Boolean)
Selects a rebar item in the rebar database with the given grade and nominal diameter.
Grade: The grade of the rebar item to select.
Diameter: The diameter of the rebar item to select.
UseNominalDiameter:
If set to false, the item is selected based on the actual diameter.
If true, the item is selected based on the nominal diameter.
Returns: The first RebarItem that matches the conditions.

Tekla.Structures.Catalogs.RebarItemEnumerator.DeleteRebarItem(Tekla.Structures.Catalogs.RebarItem)
Delete the RebarItem from the list
rebarItem: item to delete
Returns: True on success

Tekla.Structures.Catalogs.RebarItemEnumerator.ModifyRebarItem(Tekla.Structures.Catalogs.RebarItem,Tekla.Structures.Catalogs.RebarItem)
Modify the RebarItem in the list
rebarItem: item to modify
originalRebarItem: original Rebar Item to match
Returns: True on success

Tekla.Structures.Catalogs.RebarItemEnumerator.InsertRebarItem(Tekla.Structures.Catalogs.RebarItem)
Insert the RebarItem in to the list
rebarItem: Item to insert
Returns: True on success

Tekla.Structures.Catalogs.RebarItemEnumerator.RebarItemExists(Tekla.Structures.Catalogs.RebarItem)
Check RebarItem is available in database file
rebarItem: rebarItem to check with rebar db
Returns: True on rebar item exist in data base

Tekla.Structures.Catalogs.RebarItemEnumerator.GetRebarHeaderItems
Gets the header items from the rebar catalog header.
Returns: The rebar header items.